Ran Plan for project: `github` dir: `apps/github` workspace: `github`

<details><summary>Show Output</summary>

```diff
github_repository.repo["dotfiles-nix"]: Drift detected (update)
github_repository.repo["k8s-apps"]: Drift detected (update)
github_repository.repo["meal-notifier"]: Drift detected (update)
github_repository.repo["twitch-bot"]: Drift detected (update)
github_repository.repo["dotfiles"]: Drift detected (update)
github_repository.repo["pulumi"]: Drift detected (update)
github_repository.repo["wiki"]: Drift detected (update)
github_repository.repo["deckmaster-config"]: Drift detected (update)
github_repository.repo["ansible_playbooks"]: Drift detected (update)
github_repository.repo["chef"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # github_repository.repo["deckmaster-config"] will be destroyed
- resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"316ce4bcf6e0b346d8fb6412e5bc753e12c6dd8fe96921c0323a1b4f6d794bbe\"" -> null
      - full_name                   = "mvaldes14/deckmaster-config" -> null
      - git_clone_url               = "git://github.com/mvaldes14/deckmaster-config.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/deckmaster-config" -> null
      - http_clone_url              = "https://github.com/mvaldes14/deckmaster-config.git" -> null
      - id                          = "deckmaster-config" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "deckmaster-config" -> null
      - node_id                     = "R_kgDOLHF-WQ" -> null
      - private                     = false -> null
      - repo_id                     = 745635417 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/deckmaster-config.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/deckmaster-config" -> null
      - topics                      = [
          - "homelab",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # github_repository.repo["k8s-lsp"] will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "MIT"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "k8s-lsp"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "neovim",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository.repo["wiki"] will be destroyed
- resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"131510884baf3a9c71c8ec56dcc0f5cdd66faadef741b15ffb377a49ced38409\"" -> null
      - full_name                   = "mvaldes14/wiki" -> null
      - git_clone_url               = "git://github.com/mvaldes14/wiki.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/wiki" -> null
      - http_clone_url              = "https://github.com/mvaldes14/wiki.git" -> null
      - id                          = "wiki" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "wiki" -> null
      - node_id                     = "R_kgDOP7uDpQ" -> null
      - private                     = true -> null
      - repo_id                     = 1069253541 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/wiki.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/wiki" -> null
      - topics                      = [
          - "personal",
        ] -> null
      - visibility                  = "private" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
    }

  # github_repository_webhook.wh["deckmaster-config"] will be destroyed
- resource "github_repository_webhook" "wh" {
      - active     = true -> null
      - events     = [
          - "*",
        ] -> null
      - id         = "521145053" -> null
      - repository = "deckmaster-config" -> null
      - url        = "https://api.github.com/repos/mvaldes14/deckmaster-config/hooks/521145053" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - secret       = (sensitive value) -> null
          - url          = (sensitive value) -> null
        }
    }

  # github_repository_webhook.wh["k8s-lsp"] will be created
+ resource "github_repository_webhook" "wh" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "*",
        ]
      + id         = (known after apply)
      + repository = "k8s-lsp"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

Plan: 2 to add, 0 to change, 3 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p github`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=mvaldes14%252Fterraform%252Fapps%252Fgithub%252Fgithub)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p github`
</details>
Plan: 2 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`